[Download Dataset](https://www.kaggle.com/kaggle/sf-salaries)

In [49]:
import pandas as pd
import numpy as np

In [5]:
data = pd.read_csv('Salaries.csv')
df = data

### 1.Display Top 10 Rows of The Dataset

In [6]:
df.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

### 2. Check Last 10 Rows of The Dataset

In [7]:
df.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148645,148646,Carolyn A Wilson,Human Services Technician,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148646,148647,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148648,148649,Leon Walker,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

### 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [11]:
print(f" There are {df.shape[0]} rows and {df.shape[1]} columns")

 There are 148654 rows and 13 columns

### 4. Getting Information About Our Dataset Like Total Number Rows, 
### Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

### 5.Check Null Values In The Dataset

In [16]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

### 6. Drop ID, Notes, Agency and Status Columns

In [28]:
df_new = df

In [29]:
df_new = df_new.drop(['Id','Notes','Agency','Status'], axis = 1)
df_new

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014
148650,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014
148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014
148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014
148653,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014

### 7. Get Overall Statistics About The Dataframe

In [21]:
df_new.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

### 8. Find Occurrence of The Employee Names  (Top 5)

In [30]:
df.EmployeeName.value_counts().head(5)

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: EmployeeName, dtype: int64

### 9. Find The Number of Unique Job Titles

In [36]:
df.JobTitle.nunique()

2159

### 10. Total Number of Job Titles Contain Captain

In [51]:
df.JobTitle = df.JobTitle.str.lower()

In [52]:
df.JobTitle = df.JobTitle.str.strip()

In [53]:
df.JobTitle[df.JobTitle.str.contains("captain")].count()

552

### 11. Display All the Employee Names From Fire Department

In [58]:
df.EmployeeName[df.JobTitle.str.contains("fire")].reset_index()

       index        EmployeeName
0          4     PATRICK GARDNER
1          6           ALSON LEE
2          8      MICHAEL MORRIS
3          9  JOANNE HAYES-WHITE
4         10       ARTHUR KENNEY
...      ...                 ...
5874  145956    Kenneth C Farris
5875  147556       Edward A Dunn
5876  148021      Kari A Johnson
5877  148209        Sheryl K Lee
5878  148554     Lawrence F Gatt

[5879 rows x 2 columns]

### 12. Find Minimum, Maximum and Average BasePay

In [64]:
df.BasePay.describe()

count    148045.000000
mean      66325.448840
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

### 13. Replace 'Not Provided' in EmployeeName' Column to NaN

In [85]:
df.EmployeeName = df.EmployeeName.str.lower()

In [86]:
df.EmployeeName = df.EmployeeName.str.strip()

In [87]:
df['EmployeeName'].replace("not provided",np.nan)

0            nathaniel ford
1              gary jimenez
2            albert pardini
3         christopher chong
4           patrick gardner
                ...
148649        roy i tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            joe lopez
Name: EmployeeName, Length: 148654, dtype: object

### 14. Drop The Rows Having 5 Missing Values

In [93]:
df_drop = df.dropna(thresh = 5)

### 15. Find Job Title of ALBERT PARDINI

In [96]:
df.JobTitle[df.EmployeeName == "albert pardini"].reset_index()

   index                         JobTitle
0      2  captain iii (police department)
1  36519                        captain 3

### 16. How Much ALBERT PARDINI Make (Include Benefits) ?

In [115]:
df[['TotalPayBenefits','Year']][df.EmployeeName == "albert pardini"].reset_index()

   index  TotalPayBenefits  Year
0      2         335279.91  2011
1  36519         253995.29  2012

### 17. Display Name of The Person Having The Highest BasePay

In [154]:
ind = df.index[df.BasePay == df.BasePay.max()].tolist()

In [161]:
df.iloc[ind]['EmployeeName'].str.upper().reset_index()

   index    EmployeeName
0  72925  GREGORY P SUHR

### 18. Find Average BasePay of All Employee Per Year

In [125]:
dd = df.groupby('Year').mean("BasePay")

In [140]:
dd['BasePay'].reset_index()

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

### 19. Find Average BasePay of All Employee Per JobTitle

In [141]:
job = df.groupby('JobTitle').mean("Basepay")
job['BasePay'].reset_index()

                                            JobTitle       BasePay
0                                      account clerk  42593.966897
1                                         accountant  46643.172000
2                                       accountant i  61777.832500
3                                      accountant ii  66880.084425
4                                     accountant iii  78940.945000
...                                              ...           ...
1632              worker's compensation supervisor i  90966.140000
1633                           x-ray laboratory aide  46412.085794
1634                              youth comm advisor  39077.957500
1635  youth commission advisor, board of supervisors  52609.910000
1636                                     zoo curator  43148.000000

[1637 rows x 2 columns]

### 20. Find Average BasePay of Employee Having Job Title ACCOUNTANT

In [165]:
df[df.JobTitle == "accountant"].mean()[1]

/var/folders/p3/m5hh4tgj36z4r763hs22tq3h0000gp/T/ipykernel_1464/3173561981.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df[df.JobTitle == "accountant"].mean()[1]

46643.172

### 21. Find Top 5 Most Common Jobs

In [147]:
df.JobTitle.value_counts().head(5).reset_index()

              index  JobTitle
0  transit operator      9424
1     special nurse      5791
2  registered nurse      4955
3         custodian      3214
4       firefighter      3153